## MINI PROJECT 1

## Read the data

In [2]:
import pandas as pd
df=pd.read_excel(r"C:\Users\ayesh\OneDrive\Desktop\weather_data_XL.xlsx")
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    Hyderbad             28          60     Sunny
1 2025-01-02    Hyderbad             29          62     Sunny
2 2025-01-03    Hyderbad             30          58    Cloudy
3 2025-01-04    Hyderbad             31          55    Cloudy
4 2025-01-05    Banglore             32          57     Rainy
5 2025-01-06    Banglore             33          59     Rainy
6 2025-01-07    Banglore             34          61     Sunny
7 2025-01-08    Banglore             32          63    Cloudy
8 2025-01-09  Vijayawada             31          64     Rainy
9 2025-01-10  Vijayawada             29          62     Sunny

## Exploring data

In [3]:
df.head()

        Date      City  Temperature_C  Humidity_% Condition
0 2025-01-01  Hyderbad             28          60     Sunny
1 2025-01-02  Hyderbad             29          62     Sunny
2 2025-01-03  Hyderbad             30          58    Cloudy
3 2025-01-04  Hyderbad             31          55    Cloudy
4 2025-01-05  Banglore             32          57     Rainy

In [4]:
df.head(10)

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    Hyderbad             28          60     Sunny
1 2025-01-02    Hyderbad             29          62     Sunny
2 2025-01-03    Hyderbad             30          58    Cloudy
3 2025-01-04    Hyderbad             31          55    Cloudy
4 2025-01-05    Banglore             32          57     Rainy
5 2025-01-06    Banglore             33          59     Rainy
6 2025-01-07    Banglore             34          61     Sunny
7 2025-01-08    Banglore             32          63    Cloudy
8 2025-01-09  Vijayawada             31          64     Rainy
9 2025-01-10  Vijayawada             29          62     Sunny

In [5]:
df.tail()

        Date        City  Temperature_C  Humidity_% Condition
5 2025-01-06    Banglore             33          59     Rainy
6 2025-01-07    Banglore             34          61     Sunny
7 2025-01-08    Banglore             32          63    Cloudy
8 2025-01-09  Vijayawada             31          64     Rainy
9 2025-01-10  Vijayawada             29          62     Sunny

In [6]:
df.tail(7)

        Date        City  Temperature_C  Humidity_% Condition
3 2025-01-04    Hyderbad             31          55    Cloudy
4 2025-01-05    Banglore             32          57     Rainy
5 2025-01-06    Banglore             33          59     Rainy
6 2025-01-07    Banglore             34          61     Sunny
7 2025-01-08    Banglore             32          63    Cloudy
8 2025-01-09  Vijayawada             31          64     Rainy
9 2025-01-10  Vijayawada             29          62     Sunny

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           10 non-null     datetime64[ns]
 1   City           10 non-null     object
 2   Temperature_C  10 non-null     int64
 3   Humidity_%     10 non-null     int64
 4   Condition      10 non-null     object
dtypes: datetime64[ns](1), int64(2), object(2)
memory usage: 532.0+ bytes

In [8]:
df.columns

Index(['Date', 'City', 'Temperature_C', 'Humidity_%', 'Condition'], dtype='object')

In [9]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [10]:
df.dtypes

Date             datetime64[ns]
City                     object
Temperature_C             int64
Humidity_%                int64
Condition                object
dtype: object

In [11]:
df.Date

0   2025-01-01
1   2025-01-02
2   2025-01-03
3   2025-01-04
4   2025-01-05
5   2025-01-06
6   2025-01-07
7   2025-01-08
8   2025-01-09
9   2025-01-10
Name: Date, dtype: datetime64[ns]

In [12]:
df.City

0      Hyderbad
1      Hyderbad
2      Hyderbad
3      Hyderbad
4      Banglore
5      Banglore
6      Banglore
7      Banglore
8    Vijayawada
9    Vijayawada
Name: City, dtype: object

In [13]:
df.shape

(10, 5)

In [14]:
df[2:5]

        Date      City  Temperature_C  Humidity_% Condition
2 2025-01-03  Hyderbad             30          58    Cloudy
3 2025-01-04  Hyderbad             31          55    Cloudy
4 2025-01-05  Banglore             32          57     Rainy

In [15]:
df[['Date','Condition']]

        Date Condition
0 2025-01-01     Sunny
1 2025-01-02     Sunny
2 2025-01-03    Cloudy
3 2025-01-04    Cloudy
4 2025-01-05     Rainy
5 2025-01-06     Rainy
6 2025-01-07     Sunny
7 2025-01-08    Cloudy
8 2025-01-09     Rainy
9 2025-01-10     Sunny

In [21]:
Data={
    'Name':['Aruna','Tulasi','Moina','Sravanthi','Manasa','Devi','Sriya','Roshini','Jaya','Anitha','Hannah'],
  
    'Branch':['BCA','BCA','BCA','BSC','BSC','BBA','BBA','BCA','BBA','BSC','BCA'],
    'Marks':[100,99,98,95,93,89,94,79,88,90,91],
  
}
df=pd.DataFrame(Data)
df

         Name Branch  Marks
0       Aruna    BCA    100
1      Tulasi    BCA     99
2       Moina    BCA     98
3   Sravanthi    BSC     95
4      Manasa    BSC     93
5        Devi    BBA     89
6       Sriya    BBA     94
7     Roshini    BCA     79
8        Jaya    BBA     88
9      Anitha    BSC     90
10     Hannah    BCA     91

In [22]:
df.head()

        Name Branch  Marks
0      Aruna    BCA    100
1     Tulasi    BCA     99
2      Moina    BCA     98
3  Sravanthi    BSC     95
4     Manasa    BSC     93

In [23]:
df.head(8)

        Name Branch  Marks
0      Aruna    BCA    100
1     Tulasi    BCA     99
2      Moina    BCA     98
3  Sravanthi    BSC     95
4     Manasa    BSC     93
5       Devi    BBA     89
6      Sriya    BBA     94
7    Roshini    BCA     79

In [24]:
df.tail()

       Name Branch  Marks
6     Sriya    BBA     94
7   Roshini    BCA     79
8      Jaya    BBA     88
9    Anitha    BSC     90
10   Hannah    BCA     91

In [26]:
df.tail(9)

         Name Branch  Marks
2       Moina    BCA     98
3   Sravanthi    BSC     95
4      Manasa    BSC     93
5        Devi    BBA     89
6       Sriya    BBA     94
7     Roshini    BCA     79
8        Jaya    BBA     88
9      Anitha    BSC     90
10     Hannah    BCA     91

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    11 non-null     object
 1   Branch  11 non-null     object
 2   Marks   11 non-null     int64
dtypes: int64(1), object(2)
memory usage: 396.0+ bytes

In [28]:
df.columns

Index(['Name', 'Branch', 'Marks'], dtype='object')

In [29]:
df.index

RangeIndex(start=0, stop=11, step=1)

In [30]:
df.dtypes

Name      object
Branch    object
Marks      int64
dtype: object

In [31]:
df.Name

0         Aruna
1        Tulasi
2         Moina
3     Sravanthi
4        Manasa
5          Devi
6         Sriya
7       Roshini
8          Jaya
9        Anitha
10       Hannah
Name: Name, dtype: object